Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དམ་པ་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Padmottara who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Padmaśrī, was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Going there, he asked that blessed one, the tathāgata Padmaśrī, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དམ་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་སྟེང་གི་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Padmaśrī, replied to the bodhisattva great being Padmottara, “Noble son, from here, in the direction of the zenith, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དམ་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མོའི་དཔལ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར།
en: The bodhisattva great being Padmottara said to that blessed one, the tathāgata Padmaśrī, “Blessed Lord!

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མོའི་དཔལ་གྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དམ་པ་ལ།
en: That blessed one, the tathāgata Padmaśrī, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མོའི་དཔལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ།
en: The tathāgata Padmaśrī gave the bodhisattva great being Padmottara a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son, you should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Padmaśrī, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དམ་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: Then the bodhisattva great being Padmottara received from that blessed one, the tathāgata, arhat, completely awakened Buddha Padmaśrī, those golden-colored, thousand-petaled lotuses.

source: འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ་མེ་ཏོག་དང་སྤོས་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་རྒྱན་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the direction of the nadir, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, resided.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མོ་དམ་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Arriving there, he bowed his head toward the feet of the Blessed One and took a place to one side.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེ་འམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་།
en: Having taken a place to one side, the bodhisattva great being Padmottara then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Padmaśrī, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དཔལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་པད་མོ་དེ་དག་བཞེས་ནས། འོག་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses and scattered them in the world systems in the direction of the nadir, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །ཆོས་བསྟན་པ་དེ་སེམས་ཅན་གང་གིས་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: All beings who heard that teaching of the Dharma became assured of reaching unsurpassed, complete enlightenment.

source: མཆོད་པ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་སྟེང་གི་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་མདངས་དགའ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Beyond all the world systems in the direction of the zenith, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Nandā.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resides and lives the tathāgata, arhat, completely awakened buddha called Nandaśrī, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བས་བྱིན་པ་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དགའ་བའི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Nandadatta who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Nandaśrī, was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Going there, he asked that blessed one, the tathāgata Nandaśrī, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བས་བྱིན་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་འོག་གི་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Nandaśrī, replied to the bodhisattva great being Nandadatta, “Noble son, from here, in the direction of the nadir, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བས་བྱིན་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར།
en: Such is his power.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དཔལ་གྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བས་བྱིན་པ་ལ།
en: That blessed one, the tathāgata Nandaśrī, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དཔལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ།
en: The tathāgata Nandaśrī gave to the bodhisattva great being Nandadatta a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son, you should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Nandaśrī, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བས་བྱིན་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: Then the bodhisattva great being Nandadatta received from that blessed one, the tathāgata, arhat, completely awakened Buddha Nandaśrī, those golden-colored, thousand-petaled lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་དང་། ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་འགྲོགས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས། སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ་མེ་ཏོག་དང་། སྤོས་དང་། བདུག་སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། རྒྱན་དང་།
en: Accompanied by many hundred billion trillions of bodhisattvas in the form of householders, mendicants, young men, and young women, he vanished from that buddhafield.

source: གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་དང་མཆོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the direction of the zenith, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, resided.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བས་བྱིན་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དཔལ། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་།
en: Having taken a place to one side, the bodhisattva great being Nandadatta then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Nandaśrī, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དཔལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས། པད་མོ་དེ་དག་བཞེས་ནས། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses and scattered them in the world systems in the direction of the zenith, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །དེ་ནས་པད་མོ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏེ། པད་མོ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མང་པོ་བཞུགས་ཤིང་འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་ཉིད་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ།
en: The lotuses fully covered all those world systems, and upon them many bodies of the tathāgatas were seated, teaching this very doctrine, from the six perfections onward.

source: །ཆོས་བསྟན་པ་དེ་སེམས་ཅན་གང་གིས་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་བ་དང་རབ་ཏུ་བྱུང་བ་དང་།
en: All beings who heard that teaching of the Dharma became assured of reaching unsurpassed, complete enlightenment.

source: །དེ་ནས་དེའི་ཚེ་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ལ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེའི་རང་བཞིན་དུ་ཀུན་ནས་གནས་པར་གྱུར་ཏེ། མེ་ཏོག་སིལ་མ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་གང་བ་དང་། དར་གྱི་ལྡ་ལྡི་དང་། ཆུན་པོ་ཀུན་ནས་བྲེས་པ་དང་། སྣོད་སྣ་ཚོགས་ནས་བདུག་སྤོས་སྣ་ཚོགས་འཐུལ་བ་དང་།
en: At that time, in a single fleeting instant, this great trichiliocosm was completely transformed into the nature of gemstones, replete with scattered flowers and completely bedecked with wreaths and bundles of silk.

source: དཔག་བསམ་གྱི་ཤིང་རྒྱན་དང་འབྲས་བུ་སྣ་ཚོགས་ཀྱིས་ཡལ་གའི་རྩེ་མོ་གཡུར་ཟ་བ་དང་། མེ་ཏོག་གི་ཤིང་དང་འབྲས་བུའི་ཤིང་དང་སྤོས་ཀྱི་ཤིང་དང་ཕྲེང་བའི་ཤིང་དང་ཕྱེ་མའི་ཤིང་དང་། བདུག་སྤོས་ཀྱི་ཤིང་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་ཀུན་ནས་གནས་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ཀུན་ནས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་ན། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདུག་པ་དང་། ལྷའི་བུ་བློ་གྲོས་ཤིན་ཏུ་བརྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་ཡང་གཟི་བརྗིད་ཆེན་པོ་དག་འཁོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་པད་མོ་ཅན་བཞིན་དུ་གྱུར་ཏོ།
en: Various kinds of incense wafted from various containers, and it was completely adorned with wish-granting trees, the tips of their branches ornate and fully ripe with fruits, and with all kinds of flowering trees, fruit trees, trees of fragrance, trees of garlands, trees of powders, and trees of incense, just like the world system of Padmavatī, the buddhafield of that blessed one, the tathāgata, arhat, completely awakened Buddha Samantakusuma, where the crown prince Mañjuśrī resides alongside the god Susthitamati and other bodhisattva great beings of mighty splendor.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This completes the first chapter, “The Context,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེའི་ཚེ་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་ལྷ་དང་བཅས་པ་བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་བྲམ་ཟེའི་སྐྱེ་དགུ་དང་བཅས་པ། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པ་མང་པོ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ་མང་པོ་དེ་དག་འདུས་པར་ཐུགས་སུ་ཆུད་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: Chapter 2: Śāriputra At that time, when the Blessed One thus understood that the entire world had assembled—a great multitude with its gods, māras, Brahmā divinities, all kinds of beings including ascetics and brahmins, gods, humans, and asuras, as well as numerous bodhisattva great beings most of whom were crown princes— he said to the venerable Śāradvatīputra: {Dt.18} “Śāradvatīputra, bodhisattva great beings who wish to attain consummate buddhahood with respect to all phenomena in all their aspects should persevere in the perfection of wisdom.”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱི།
en: The venerable Śāradvatīputra then asked the Blessed One, “Blessed Lord, how should bodhisattva great beings who wish to attain consummate buddhahood with respect to all phenomena in all their aspects persevere in the perfection of wisdom?”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཏེ།
en: The Blessed One replied to Śāradvatīputra, “Śāradvatīputra, in this regard, bodhisattva great beings should stay in the perfection of wisdom without there being any place to stay.

source: སྦྱིན་པ་དང་གཏོང་བ་དང་ཡོངས་སུ་ལེན་པ་མི་དམིགས་པའི་ཕྱིར། ཡོངས་སུ་གཏོང་བ་མེད་པའི་ཚུལ་གྱིས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: That is, they should perfect the perfection of generosity without there being any giving up, since no gift, giver, or recipient is apprehended.

source: །ལྟུང་བ་དང་མི་ལྟུང་བ་བྱ་བ་མེད་པའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They should perfect the perfection of ethical discipline, since there are no downfalls or nondownfalls to be committed.

source: །འཁྲུག་པ་མེད་པའི་ཕྱིར། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They should perfect the perfection of tolerance, since there is no disturbance.

source: །ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ཉམས་པ་མེད་པའི་ཕྱིར། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They should perfect the perfection of perseverance, since there is no weakening of physical or mental effort.

source: །རོ་མྱོང་བ་མེད་པའི་ཕྱིར། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They should perfect the perfection of meditative concentration, since there is no experience to relish.

source: །ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They should perfect the perfection of wisdom, since no phenomena are apprehended. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཏེ། དྲན་པ་མི་དམིགས་པའི་ཕྱིར། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: Śāradvatīputra, bodhisattva great beings, abiding in the perfection of wisdom, should perfect the four applications of mindfulness since mindfulness is not apprehended.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: They should perfect the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: །སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་།
en: They should perfect the meditative stability of emptiness, the meditative stability of signlessness, and the meditative stability of wishlessness.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། རྣམ་པར་བམ་པའི་འདུ་ཤེས་དང་། འབུ་ཅན་གྱི་འདུ་ཤེས་དང་། རྣམ་པར་རྣགས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་དམར་བའི་འདུ་ཤེས་དང་། རྣམ་པར་སྔོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་ཟོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་འཐོར་བའི་འདུ་ཤེས་དང་། རུས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་ཚིག་པའི་འདུ་ཤེས་དང་། ཟས་མི་མཐུན་པའི་འདུ་ཤེས་བསྒོམ་པར་བྱའོ། །སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་རྗེས་སུ་དྲན་པ་དང་། སྐྱོ་བ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་དང་། ལུས་ཀྱི་རྣམ་པ་རྗེས་སུ་དྲན་པ་དང་། མི་རྟག་པའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་གྱི་འདུ་ཤེས་དང་། བདག་མེད་པའི་འདུ་ཤེས་དང་། མི་སྡུག་པའི་འདུ་ཤེས་དང་། འཆི་བའི་འདུ་ཤེས་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལ་དགའ་བར་མི་བྱ་བའི་འདུ་ཤེས་དང་།
en: They should cultivate the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the five extrasensory powers, the contemplation of a bloated corpse, the contemplation of a worm-infested corpse, the contemplation of a putrefied corpse, the contemplation of a bloody corpse, {Dt.20} the contemplation of a blue-black corpse, the contemplation of a devoured corpse, the contemplation of a dismembered corpse, the contemplation of a skeleton, the contemplation of an immolated corpse, and the contemplation of the unpleasantness of food.
